<template>
  <div class="editorial">
    <div class="pd20">
      <div class="base-panel">
        <div class="base-panel-header">
          <span>编委会（第五届）</span>
          <!-- <el-button class="more-btn" type="text">更多</el-button> -->
        </div>
        <div class="base-panel-body">
          <div>顾 问</div>
          <div>
            申瑞源（中国铁路总公司 运输局机务部）
            曾会欣（国家铁路局 科技司）
            齐延辉（中国铁路总公司 科技管理部）
            吴国栋（中国铁路总公司 运输局机辆部）
            张大勇（中国铁路总公司 运输局机辆部）
            孙永才（中国中车股份有限公司）
            主 任
            陈 凯（中车青岛四方车辆研究所有限公司）
            编 委（按姓氏笔画为序）
            万 芳（中车青岛四方车辆研究所有限公司）
            于跃斌（齐齐哈尔轨道交通装备有限责任公司）
            王风洲（中车青岛四方车辆研究所有限公司）
            王勇智（中国中车股份有限公司）
            田玉坤（中车青岛四方车辆研究所有限公司）
            田葆栓（中车青岛四方车辆研究所有限公司）
            刘长青（中车长春轨道客车股份有限公司）
            刘宏友（中车青岛四方车辆研究所有限公司）
            乔红刚（中国铁路沈阳局集团有限公司 车辆处）
            孙守光（北京交通大学）
            杜永明（中国铁路总公司 运输局机辆部）
            李 芾（西南交通大学 机械工程学院）
            李国平（中车青岛四方车辆研究所有限公司）
            李 福（中国铁路总公司 科技管理部装备技术处）
            张 伟（中国铁路上海局集团有限公司 车辆处）
            张新宁（中国中车股份有限公司）
            陈 亮（中车唐山机车车辆有限公司）
            陆正刚（同济大学 铁道与城市轨道交通研究院）
            孟 葳（中国铁道科学研究院 机车车辆研究所）
            单 魏（中国铁路总公司 运输局机辆部）
            宫 涛（中国铁路北京局集团有限公司 车辆处）
            胡海滨（中车长江车辆有限公司）
            施青松（中车南京浦镇车辆有限公司）
            栾平景（中车青岛四方车辆研究所有限公司）
            郭文兰（中国铁路太原局集团有限公司 车辆处）
            龚 明（中车研究院）
            梁建英（中车青岛四方机车车辆股份有限公司）
            谢步明（中国中车股份有限公司）
            甄 静（国家铁路局 科技司）
            穆 鑫（中国铁路总公司 运输局机辆部）
            编委会（第四届）
            顾 问
            张曙光
            陈伯施
            刘 刚
            奚国华
            唐克林
            主 任
            赵云生
            委 员（按姓氏笔画为序）
            于连友 王风洲 牛得田 田玉坤 安 卫 孙守光 刘宏友
            孙邦成 齐延辉 刘桂军 刘瑞扬 池敏敢 李 芾 李国平
            张泽伟 李培署 邢鸿麟 肖 颖 孟庆彦 杨 京 陈 凯
            罗运康 陈 雷 侯卫星 赵大斌 郑建平 赵洪伦 徐小平
            栾平景 聂 星 龚 明 黄 强 韩志坚 游金泉 程海涛
            隋瑞政 潘 立
            编委会（第三届）
            顾 问
            周翊民 谈大同 宋凤书 张庆林
            主 任
            侯卫星
            副主任
            陈松林 吴新民 张进德
            委 员（按姓氏笔画为序）
            王凤洲 王式宏 王奎瑛 王焕章 王维胜 仇佩信 史贵林
            宁英杰 宁德容 邢鸿麟 伍寿南 孙国祥 严隽耄 李世亮
            李宝树 杨国桢 张宁鹏 陈伯施 陈炳源 范雨霖 赵光宪
            胡卓人 胡建明 钱立新 徐小平 徐国明 黄 强 曹 阳
            阎祖桐 靳谊勇 廉 洁 翟智民 缪龙秀 潘亮昭 薛 淳
            鞠在云
            编委会（第二届）
            顾 问
            主 任
            委 员（按姓氏笔画为序）
            编委会（第一届）
            顾 问
            主 任
            委 员（按姓氏笔画为序）
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
// import quesRadioBase from "../../components/QuesRadioBase";
export default {
  components: {},
  data() {
    return {
      // userId: this.$route.query.userId || "",
    };
  },
  mounted() {
    // this.init();
  },
  methods: {
    init() {
      // this.$api.doclist.findAllDic([this.id]).then(res => {
      //   console.log(res);
      // });
    }
  }
};
</script>
<style lang="less" scoped>
@import "../../assets/less/base.less";
@import "../../assets/less/main.less";
</style>
