export const CARD_TYPE = [
  { label: '居民身份证', value: '1' },
  { label: '港澳居民身份证', value: '2' },
  { label: '台湾居民身份证', value: '3' },
  { label: '护照', value: '4' },
  { label: '军官证', value: '5' },
  { label: '出生证明', value: '6' }
]
export const SEX_TYPE = [
  { label: '男', value: '1' },
  { label: '女', value: '2' }
]
export const FAMILY_RALATION = [
  { label: '父母', value: '1' },
  { label: '夫妻', value: '2' },
  { label: '子女', value: '3' },
  { label: '孙（女）或外孙（女）', value: '4' },
  { label: '祖父母或外祖父母', value: '5' },
  { label: '兄弟姐妹', value: '6' },
  { label: '其他', value: '7' }
]
export const RESPONSE_CODES_MESSAGE = {
  '1': '请求成功',
  '0': '必须为POST请求',
  '-1': '请求参数异常(auth失败)',
  '-2': '请求参数异有空值(业务参数)',
  '-3': '参数的值不符合规则',
  '-4': '权限错误 SIGN规则不符合',
  '-5': '用户没有该方法的权限',
  '-500': '登陆设备不一样',
  '-501': '密码改变了',
  '-502': '时间失效了'
}
export const PAY_STATUS = ['', '预约', '取消', '爽约', '已取号']
export const DOCTOR_TYPE = {
  '01': '全科医生',
  '02': '全科护士',
  '03': '公卫医生',
  '04': '公卫护士',
  '05': '计生医生',
  '06': '中医师',
  '09': '其他'
}
export const PAYED_STATUS = ['未发药', '已发药', '已作废', '退药', '未执行', '已执行']
export const CANCEL_ORDER_RESIONS = [
  '病好了，不看了',
  '挂错号了',
  '临时有事，改天再预约',
  '换个医院/医生',
  '其他原因'
]
export const APPOINT_TIPS = [
  '您可使用一卡通和社保卡进行预约。',
  '您可预约当天及未来四周的专家及普通号源。',
  '预约挂号费在就诊时扣除，请您在就诊前保证卡内有足够的金额，以免影响正常就诊。',
  '取号方式：可通过微信公众号或支付宝服务窗签到取号（目前只支持自费），或通过自助机进行取号确认。',
  '取号<span class="t2">注意事项</span>：就诊<span class="t2">当日</span>凭一卡通或社保卡提前<span class="t2">30分钟至1小时</span>到自助机取号（<span class="t2">过早无法取号</span>）；手机平台预约可通过手机进行签到取号（超过预约时间1个小时后未取号，系统视为失约，需要重新挂号，失约三次将进入黑名单）。',
  '预约成功后，您因个人原因无法就诊，请提前一天通过本平台进行取消预约，逾期无法取消，三次失约后将进入黑名单。',
  '专家临时停诊，本平台将短信或电话通知您，同时为您取消本次预约，如有疑问请拨打预约服务部电话（<a href="tel://0533-2360101">2360101</a>/<a href="tel://0533-2360352">2360352</a>）咨询。'
]
export const HIS_CARD_TYPE = [
  // {label: '测试用的卡', value: '5'},
  { label: '一卡通', value: '2' },
  { label: '社保(医保)卡', value: '3' }
  // {label: '门诊卡', value: '5'},
  // {label: '其他', value: '9'}
]
export const CARD_TYPE2 = [
  { label: '预留手机号', value: '2' },
  { label: '卡认证', value: '1' }
]
export const PAYED_STATUS_ORDER = ['', '未支付', '已支付', '已挂账']
export const BIND_CARD_TIPS = [
  '就诊人通过身份认证绑定医院账号，与医院建档信息进行匹配；',
  '如就诊人无医院就诊卡，请至医院窗口服务窗办理；',
  '一卡通必须实名制。'
]
export const APPOINT_SUCCESS_TIPS = [
  '为保证顺利就诊，请在约定就诊时间前30-60分钟，进行取号（过早无法取号）；超过预约时间1小时未取号视为爽约；',
  '首次到院（无本院就诊卡）的患者，请在预约日当天提前30-60分钟到医院窗口或自助机凭预约记录的门诊号进行无证办卡取号；',
  '已有我院就诊卡患者，请携带预约时的就诊卡在就诊当日提前30-60分钟到院通过手机端或自助机进行取号就诊。'
]
export const BIND_CARD_TIPS2 = [
  // '已有我院就诊卡的患者，可选择医院预留手机号验证或卡认证两种方式进行身份认证（预留在我院的手机号停用或错误时，请至医院窗口修改），通过身份认证与医院账户进行绑定后，可在线使用预约挂号、取号、充值、报告查询等功能；',
  // '无我院就诊卡的患者，身份认证时请选择预留手机号验证方式（手机号为添加就诊人时手机号），验证通过后，可进行预约挂号，并在就诊当日凭门诊号去医院自助机或窗口进行无证办卡取号。'

  '就诊人信息用于实名就诊，不会外传。',
  '就诊人姓名、身份证号等信息在身份认证后保存后不允许修改，请核对输入正确的就诊人姓名和身份证号。',  
  '已有我院就诊卡的患者，在添加就诊人后，请进行身份认证与医院就诊卡号进行绑定，方可在线使用掌上支付、报告查询等功能。',
  '院就诊卡的患者，在添加就诊人后，通过手机号验证，再进行预约挂号，并在就诊当日凭门诊号去医院窗口进行无证办卡取号。'

]
export const IMPROVE_INFO_TIPS = [
  '就诊人姓名、身份证号等信息保存后不允许修改，请核对输入正确的就诊人姓名和身份证号；',
  '已有我院就诊卡的患者，在添加就诊人后，请进行身份认证与医院账户进行绑定，方可在线使用预约挂号、充值、报告查询等功能；',
  '无我院就诊卡的患者，在添加就诊人后，通过手机号验证，再进行预约挂号，并在就诊当日凭门诊号去医院自助机或窗口进行无证办卡取号。'
]

// 在线咨询状态
export const CONSULT_ASK_STATUS = {
  '0': '待支付',
  '1': '待接诊',
  '2': '进行中',
  '3': '待评价',
}

// 复诊配药状态
export const CONSULT_STATUS = {
  '0': '待支付',
  '1': '待接诊',
  '2': '进行中',
  '3': '待评价',
  '4': '已结束',
  '5': '已取消',
  '6': '已取消',
  '7': '已关闭',
}

// 药品订单状态
export const DRUG_STATUS = {
  '': '全部',
  '1': '待付款',
  '2': '待发货',
  '3': '待收货',
  '4': '已完成',
  '5': '已完成',
  '6': '已完成',
  '7': '已关闭',
  '9': '已关闭',
  '99': '全部'
}

// 药品订单状态
export const DRUG_STATUS2 = {
  '': '全部',
  '1': '待付款',
  '2': '待自取',
  '3': '待自取',
  '4': '已完成',
  '5': '已完成',
  '6': '已完成',
  '7': '已关闭',
  '9': '已关闭',
  '99': '全部'
}

// 物流方式
export const DRUG_METHODS = [
  { label: '物流配送', value: '1' },
  { label: '患者自取', value: '2' },
]

// 医生职称
export const DOCTOR_LEVEL = [
  { value: '', label: '不限' },
  { value: '231', label: '主任医师' },
  { value: '232', label: '副主任医师' },
  { value: '233', label: '主治医师' },
  { value: '234', label: '医师' },
  { value: '235', label: '医士' }
]

// 支付方式
export const PAY_TYPE = {
  "1": "健康钱包",
  "2": "支付宝APP",
  "2-1": "支付宝-扫码支付",
  "3": "微信APP",
  "3-1": "微信扫码支付",
  "3-2": "微信-公众号支付",
  "4": "银行卡",
  "6": "中福支付",
  "6-1": "中福支付-健康钱包",
  "6-2": "中福支付-支付宝",
  "6-3": "中福支付-微信",
  "6-4": "中福支付-银行卡",
  "99": "测试支付"
}

// 科室图像对应的雪碧图
export const topDeptData = [
  {
    name: "皮肤科",
    icon: "zxwz_icon_pfk"
  },
  {
    name: "肛肠科",
    icon: "zxwz_icon_gck"
  },
  {
    name: "血管外科",
    icon: "zxwz_icon_xgwk"
  },
  {
    name: "神经内科",
    icon: "zxwz_icon_sjnk"
  },
  
  {
    name: "消化内科",
    icon: "zxwz_icon_nk"
  },
  {
    name: "口腔科",
    icon: "zxwz_icon_kqk"
  },
  {
    name: "耳鼻咽喉科",
    icon: "zxwz_icon_ebyhk"
  },
  {
    name: "中医科",
    icon: "zxwz_icon_zyk"
  }, {
    name: "肿瘤科",
    icon: "zxwz_icon_zlk"
  },
  {
    consultDeptName: "更多",
    icon: "zxwz_icon_more"
  },
]

export const SCHEDULE_TYPE = {
  '1':'图文咨询',
  '3':'电话咨询',
  '4':'视频咨询',
  '2':'复诊配药',
  '5':'云诊室',
  '6':'协同门诊',
  '7':'在线审方',
}

export const SCHEDULE_TYPE_NAME = {
  '1':'imageAble',
  '3':'tel',
  '4':'video',
  '2':'returnVisit',
  '5':'cloudVisit',
  '6':'organ',
  '7':'online',
}
